"""
Консольный файловый менеджер:

1. Создать новый проект ""Консольный файловый менеджер"

2. В проекте реализовать следующий функционал:

После запуска программы пользователь видит меню, состоящее из следующих пунктов:

- создать папку;

- удалить (файл/папку);

- копировать (файл/папку);

- просмотр содержимого рабочей директории;

- посмотреть только папки;

- посмотреть только файлы;

- просмотр информации об операционной системе;

- создатель программы;

- играть в викторину;

- мой банковский счет;

- смена рабочей директории (*необязательный пункт);

- выход.

Так же можно добавить любой дополнительный функционал по желанию.
"""